{
  "basics": {
    "name": "Raven Muse",
    "label": "Senior Data Scientist & AI/ML Full-stack developer",
    "image": "/portfolio/me_avatar.jpg",
    "email": "hanyue1006@hotmail.com",
    "phone": "",
    "url": "https://github.com/RavenMuse/portfolio",
    "summary": "I'm a seasoned tech professional with over 10 years of experience in data science, AI/ML full-stack software development. As a former Senior Data Scientist and Software Architect at Dmall, I gained extensive hands-on experience in machine learning, big data analytics, and LLM technologies. I’ve successfully led the development of complex systems, including recommendation systems, user operation systems, public opinion monitoring, supply chain optimization, and AI data assistants. Currently, I'm advancing cutting-edge research in LLM and CV algorithms at a research institute affiliated with Tsinghua University.",
    "theme": "red",
    "location": {
      "address": "",
      "postalCode": "10001",
      "city": "Chengdu",
      "countryCode": "CN",
      "region": "China"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "RavenMuse",
        "url": "https://www.linkedin.com/in/ravenmuse"
      },
      {
        "network": "Facebook",
        "username": "RavenMuse",
        "url": "https://www.facebook.com/profile.php?id=61566180404752"
      },
      {
        "network": "X",
        "username": "RavenMuse",
        "url": "https://x.com/StoneBox2"
      },
      {
        "network": "GitHub",
        "username": "RavenMuse",
        "url": "https://github.com/RavenMuse"
      }
    ]
  },
  "work": [
    {
      "name": "SC-EIRI",
      "position": "Senior Technical Manager",
      "location_type": "On site",
      "location": "Chengdu, China",
      "url": "https://en.tsinghua-eiri.org/",
      "startDate": "2024-01-20",
      "endDate": null,
      "summary": "As the project leader for intelligent energy construction projects and research, I'm involved in the entire project workflow, including project application, requirements communication, technical solutions, outsourcing, R&D management, algorithm application development, reporting and acceptance, as well as academic paper writing.",
      "highlights": [
        "Improved website performance by optimizing code"
      ],
      "responsibilities": [
        "Build R&D platform and operation and maintenance from scratch, including internal and external network, AI server, security components, CI/CD environment, and standardized project R&D process.",
        "Propose the productization plan of project results, undertake requirements refinement, competitive research, product design, etc..",
        "Responsible for algorithm application research and development, training or fine-tuning of large language model and CV algorithms, such as Llama3, ChatGLM3, YOLOv11, Depth Anything, SAM, etc., combined with AR technology to empower intelligent construction."
      ],
      "achievements": [
        "AI+AR engineering assistant project of a survey institute of the Electric Power Construction Group reaches the delivery of the first phase of the project.",
        "Completes the prototype and PRD of the product, designs the AR device + end-side CV service + cloud large model service technical solution.",
        "Improves the interaction capability through ASR + LLM FC in UnityAR application, realizes the functions of user logging in, AR scanning, engineering BIM virtual and real overlay, target detection, depth estimation and size measurement functions."
      ],
      "skills": [
        "Figma",
        "Python",
        "Jupyter",
        "Pytorch",
        "Fastapi",
        "Pydantic",
        "Llama",
        "Langchain",
        "PostgreSQL",
        "Huggingface"
      ]
    },
    {
      "name": "Dmall",
      "position": "Senior Data Scientist",
      "location_type": "On site",
      "location": "Chengdu, China",
      "url": "https://emea.dmall.com/#/",
      "startDate": "2016-05-10",
      "endDate": "2024-01-17",
      "summary": "Head of retail intelligent operation and data innovation projects, led the team to explore and realize data intelligence projects using AI, machine learning and other algorithmic engineering techniques, and participated in the construction of data warehouse and data platform and some data BI product development in the early stage.",
      "highlights": [
        "Contributed to a major project that streamlined internal workflows, improving efficiency by 30%"
      ],
      "responsibilities": [
        "Lead the exploration of BI+AI application, responsible for AI data assistant project, practicing cutting-edge AIGC technology, responsible for BI Agent design, RAG framework design and development.",
        "Responsible for Retail Intelligent Operation and Data Innovation Project, in which leading the completion of category plan optimisation, inventory optimisation, merchandise anomaly analysis, user lifecycle prediction, and promotional merchandise order forecast.",
        "Responsible for Recommendation System and Public Opinion System; participated in the design and development of Big Data Screen, Retail Data Portrait, and APP Evaluation Text Analysis at an early stage.",
        "Involved in data platform architecture and improvement, data warehouse design, data indicator dynamic early warning programme design, data project technical solution support."
      ],
      "achievements": [
        "Apply AI capability to data BI, replace part of the data analysis, and help non-BI personnel to get data analysis results quickly.",
        "Lead a 3-member team to improve the accuracy of retail user and product operation based on data algorithms.",
        "Solve category empirical management errors; solve supply chain inventory miscalculation by integrating complex business scenarios; discover business negligence through negative gross profit attribution.",
        "Improve 6 recommendation scenarios, optimize 2 high-exposure scenarios, and improve the conversion rate by 8%; complete the research and development of the public opinion system from 0 to 1, and Solved the needs for insight, notification, and handling of retail public opinion.",
        "Complete architecture to maintain the stability of the data platform, reconstruct the dim and dws layer data warehouses, warn business KPI anomalies with the help of probabilistic models, and complete the support of 7 data BI project solutions. "
      ],
      "skills": [
        "Python",
        "Jupyter",
        "Pytorch",
        "Fastapi",
        "Llama",
        "Langchain",
        "Vue",
        "TypeScript",
        "Sklearn",
        "Scipy",
        "Spark",
        "Iceberg",
        "Doris"
      ]
    },
    {
      "name": "Kingdee",
      "position": "Intermediate Data Engineer",
      "location_type": "On site",
      "location": "Shenzhen, China",
      "url": "https://en.kingdee.com/",
      "startDate": "2014-07-01",
      "endDate": "2016-05-01",
      "summary": "As a newcomer to the team, I learned data technology on his own and proposed to utilize big data technology to improve the efficiency of data processing; contributed to the data architecture solution for the team and participated in the whole process of developing the data platform.",
      "highlights": [
        "Completed several client projects successfully"
      ],
      "responsibilities": [
        "Responsible for big data cluster architecture design, cluster optimization, participate in task scheduling platform development, data development technology training.",
        "Participate in some of the data warehouse design and development.",
        "Participate in product operation data product development."
      ],
      "achievements": [
        "Build and maintain the data platform base components (hadoop, hive, spark, zk, kafka, redis)",
        "Complete the design and development of the task scheduling platform for ETL, to help platform users to better manage data tasks",
        "Complete the construction of 20 data warehouse tables, including some DIM, DWD, ADS tables.",
        "Organization of big data ecosystem training, explaining Spark high-performance data computing technology, and helping data research and development personnel to carry out big data transformation."
      ],
      "skills": [
        "Zookeeper",
        "Kafaka",
        "Redis",
        "SQL",
        "Java",
        "Spark",
        "Hadoop"
      ]
    }
  ],
  "education": [
    {
      "institution": "Nanjing University",
      "url": "https://stateuniversity.edu",
      "area": "Electrical Engineering and Automation",
      "studyType": "Bachelor",
      "startDate": "2010-06-01",
      "endDate": "2014-06-01"
    }
  ],
  "certificates": [],
  "skills": [
    {
      "name": "Python",
      "level": "Expert"
    },
    {
      "name": "Jupyter",
      "level": "Expert"
    },
    {
      "name": "Pytorch",
      "level": "Intermediate"
    },
    {
      "name": "Llama",
      "level": "Intermediate"
    },
    {
      "name": "Huggingface",
      "level": "Intermediate"
    },
    {
      "name": "Langchain",
      "level": "Intermediate"
    },
    {
      "name": "Sklearn",
      "level": "Intermediate"
    },
    {
      "name": "Scipy",
      "level": "Intermediate"
    },
    {
      "name": "Fastapi",
      "level": "Expert"
    },
    {
      "name": "Flask",
      "level": "Expert"
    },
    {
      "name": "Pydantic",
      "level": "Intermediate"
    },
    {
      "name": "Vue",
      "level": "Expert"
    },
    {
      "name": "TypeScript",
      "level": "Expert"
    },
    {
      "name": "Tailwind",
      "level": "Intermediate"
    },
    {
      "name": "PostgreSQL",
      "level": "Intermediate"
    },
    {
      "name": "Git",
      "level": "Intermediate"
    },
    {
      "name": "Uv",
      "level": "Intermediate"
    },
    {
      "name": "Docker",
      "level": "Intermediate"
    },
    {
      "name": "Hadoop",
      "level": "Intermediate"
    },
    {
      "name": "Spark",
      "level": "Expert"
    },
    {
      "name": "Iceberg",
      "level": "Intermediate"
    },
    {
      "name": "Doris",
      "level": "Intermediate"
    },
    {
      "name": "Figma",
      "level": "Intermediate"
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "Spanish",
      "fluency": "Intermediate"
    }
  ],
  "interests": [
    {
      "name": "Technology",
      "keywords": [
        "AI",
        "Blockchain"
      ]
    }
  ],
  "references": [
    {
      "name": "Jane Smith",
      "reference": "Reference…"
    }
  ],
  "projects": [
    {
      "name": "AR/AI Engineering Assistant",
      "isActive": true,
      "description": "Empower engineering management, design, and supervision personnel with AI and digital twin technology during the construction process to control, analyze, and analyze the full cycle of engineering construction.",
      "highlights": [
        "Built with React and Tailwind CSS",
        "Includes a blog and contact form"
      ]
    },
    {
      "name": "AI Data Assistant",
      "isActive": true,
      "description": "A web application that provides weather information for any location.",
      "highlights": [
        "Built with JavaScript and OpenWeatherMap API",
        "Responsive design"
      ],
      "url": "https://weatherapp.com"
    },
    {
      "name": "Task Manager",
      "isActive": true,
      "description": "A simple task management app to keep track of daily tasks.",
      "highlights": [
        "Built with Node.js and MongoDB",
        "User authentication and CRUD operations"
      ],
      "url": "https://taskmanager.com",
      "github": "https://github.com"
    },
    {
      "name": "E-commerce Site",
      "isActive": false,
      "description": "An online store built with Next.js and Stripe for payment processing.",
      "highlights": [
        "Product management and shopping cart functionality",
        "Secure payment integration"
      ],
      "url": "https://ecommerce.com"
    }
  ]
}